app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        book = Book.find(params[:id])

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Squanto: The Man, The Myth, The Legend"], ["created_at", "2020-11-10 18:07:23.958457"], ["updated_at", "2020-11-10 18:07:23.958457"]]
---
    def create
        book = Book.new(book_params)
        if book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "books" SET "author" = $1, "genre" = $2, "publisher" = $3, "publish_date" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["author", "Ben Dovah"], ["genre", "Instant Classic"], ["publisher", "Caister Academic Press"], ["publish_date", "2020-11-02"], ["updated_at", "2020-11-10 18:14:00.503512"], ["id", 101]]
---
    def update
        book = Book.find(params[:id])
        book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 101]]
---
    def destroy
        book = Book.destroy(params[:id])